"""
다음과 같이 출력되는 프로그램을 작성하라.
(각 요소들은 10칸씩 공간을 확보하여 이름은 왼쪽, 나이는 오른쪽으로 정렬하여 출력한다.)

"""
print("-"*30)
print("123456789012345678901234567890")
print("[{0:^10s}][{1:^10s}]".format("name","age"))
print("-"*30)
print("123456789012345678901234567890")
print("[{0:10s}][{1:10d}]".format("kimc",5))
print("[{0:10s}][{1:10d}]".format("leec",15))
print("[{0:<10s}][{1:>10d}]".format("parkc",25))
print("[{0:<10s}][{1:>10d}]".format("shinc",115))
print()
print("-"*30)
print("123456789012345678901234567890")
print("[{0:^10s}][{1:^10s}]".format("이름","나이"))
print("-"*30)
print("123456789012345678901234567890")
print("[{0:10s}][{1:10d}]".format("한사람",5))
print("[{0:10s}][{1:10d}]".format("두사람",15))
print("[{0:<10s}][{1:>10d}]".format("세사람",25))
print("[{0:<10s}][{1:>10d}]".format("네사람",115))