print(3//2)         # 1
print(-3//2)        # -2
print(10//3)        # 3
print(-10//3)       # -4
print("="*50)
# 몫을 넘지않는 최대 정수 ?
print(3/2)         # 1.5
print(3//2)        # 1
print(-3/2)        # -1.5
print(-3//2)        # -2
print("="*50)
print(10/3)        # 3.3333333333333335
print(10//3)       # 3
print(-10/3)       # -3.3333333333333335
print(-10//3)      # -4
print(-10/3.0)       # -3.3333333333333335
print(-10//3.0)      # -4.0

# 결론 : // 연산자는 몫을 넘지않는 "최대 정수 ?"를 구합니다.
