list = [[1,2,3],[4,5,6],[7,8,9]]
#  첨자를 1개를 지정하면 [] 이고 범위를 지정하면 [[]]이다.
print(list)             # [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
print(list[1])          # [4, 5, 6]
print(list[1:])         # [[4, 5, 6], [7, 8, 9]]
print(list[0:2])        # [[1, 2, 3], [4, 5, 6]]
print(list[:2])         # [[1, 2, 3], [4, 5, 6]]
print(list[1:2])        # [[4, 5, 6]]
print(list[0][0])       # 1
print(list[0][0:])      # [1,2,3]
print(list[0][:2])      # [1,2]
print(list[1:2])        # [[4, 5, 6]]
print(list[1:2][0])     # [4, 5, 6]
print(list[1:2][0][2])  # 6
print(list[1][2])       # 6
